#+OPTIONS:    H:3 num:nil toc:2 \n:nil ::t |:t ^:{} -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate hideblocks
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+TITLE:      Vala Source Code Blocks in Org Mode
#+AUTHOR:     Christian Garbs
#+EMAIL:      mitch[at]cgarbs[dot]de
#+LANGUAGE:   en
#+HTML_LINK_UP:    index.html
#+HTML_LINK_HOME:  https://orgmode.org/worg/
#+EXCLUDE_TAGS: noexport

#+name: banner
#+begin_export html
  <div id="subtitle" style="float: center; text-align: center;">
  <p>
  Org Mode support for <a href="https://wiki.gnome.org/Projects/Vala">Vala</a>
  </p>
  <!-- Vala has no logo, see https://wiki.gnome.org/Projects/Vala/Logo -->
  </div>
#+end_export

** Hello World!

#+BEGIN_SRC vala
  class Demo.HelloWorld : GLib.Object {
      public static int main(string[] args) {
          stdout.printf("Hello World!\n");
          return 0;
      }
  }
#+END_SRC

#+RESULTS:
: Hello World!

** Multiple classes

Multiple classes can be defined in a single code block:

#+BEGIN_SRC vala
  class HelloWorld : GLib.Object {
      public static void greet() {
          stdout.printf("Hello World!\n");
      }
  }

  class Demo : GLib.Object {
      public static int main(string[] args) {
          HelloWorld.greet();
          return 0;
      }
  }
#+END_SRC

#+RESULTS:
: Hello World!

** Commandline parameters

#+BEGIN_SRC vala :cmdline foo bar
  class Demo.HelloWorld : GLib.Object {
      public static int main(string[] args) {
          // skip args[0] as it is the binary name
          for (int i=1; i < args.length; i++) {
              stdout.printf("argv[%d] = %s\n" , i, args[i]);
          }
          return 0;
      }
  }
#+END_SRC

#+RESULTS:
| argv[1] | = | foo |
| argv[2] | = | bar |

The header argument =:cmdline= passes commandline arguments to the
Vala program upon execution.

Not that the automatic conversion of the result data recognizes this
output as a table.  You can change this by using the header argument
~:results verbatim~.

